cases/closedBox/2D/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     aerosolBuoyantEulerFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       1E-2;

libs            ("libcustomFunctions.so");


functions
{
    sectionalFlux
    {
        type            sectionalFlux;
        libs            ("libaerosolModels.so");
        patches         (inlet outlet walls top);
        writeControl    timeStep;
        writeInterval   1;
    }

    massFlux
    {
        type            massFlux;
        libs            ("libaerosolModels.so");
        patches         (inlet outlet walls top);
        writeControl    timeStep;
        writeInterval   1;
    }

    phiEffWater
    {
        type            boundaryFluxDensity;
        libs            ("libaerosolModels.so");
        writeControl    writeTime;
        phi             phiEff.Water.dispersed;
        result          fluxDensityWater;
    }

    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;

        fields
        (
            fluxDensityWater
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
        );
    }
}
