cases/closedBox/2D/0.org/Air.continuous
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Air.continuous;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       uniform 0.9;
    }

    outlet
    {
        type        zeroGradient;
    }

    walls
    {
        type        zeroGradient;
    }

    top
    {
        type        zeroGradient;
    }

    empties
    {
        type        empty;
    }
}
