cases/closedBox/2D/0.org/V
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      V;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type                turbulentInlet;
        referenceField      uniform (0 -0.1619 0);
        value               uniform (0 -0.1619 0);
        fluctuationScale    (0 0.4 0);
    }

    outlet
    {
        type        zeroGradientDepositionVelocity;
        value       $internalField;
    }

    walls
    {
        type        zeroGradientDepositionVelocity;
        value       $internalField;
    }

    top
    {
        type        zeroGradientDepositionVelocity;
        value       $internalField;
    }

    empties
    {
        type        empty;
    }
}
