cases/closedBox/2D/0.org/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type        compressible::alphatWallFunction;
        Prt         0.85;
        value       $internalField;
    }

    outlet
    {
        type        compressible::alphatWallFunction;
        Prt         0.85;
        value       $internalField;
    }

    walls
    {
        type        compressible::alphatWallFunction;
        Prt         0.85;
        value       $internalField;
    }

    top
    {
        type        compressible::alphatWallFunction;
        Prt         0.85;
        value       $internalField;
    }

    empties
    {
        type        empty;
    }
}
