cases/closedBox/2D/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 4;

method             simple;

simpleCoeffs
{
    n              (2 2 1);
    delta          1E-3;
}
